//Напишите программу, которая на вход принимает число (N),
//а на выходе показывает все четные числа от 1 до N.
//пример: 5 -> 2,4 ; 8 -> 2, 4, 6, 8.

Console.Write("Введите число");

   (int i in (1, int.Parse(Console.ReadLine()) >> 1));

Console.WriteLine(i << 1);